{"template":"__react_static_root__/src/containers/Post","sharedHashesByProp":{},"data":{"post":{"slug":"/2022-03-15-portfolio-rebuild-in-react","content":"\nOne lonely weekend, I decided that I should probably update my personal site to be a bit more current. Long story short, I rebuilt the entire thing in React using React Static.\n\nWhy? Mainly because I wanted to prove to myself that I actually can build pretty good looking things in React, and I felt that my previous personal site was a bit too complicated for my tastes.\n\nI knew that I only wanted two parts for my website - a blog and a small portion for my work that I wanted to highlight. I'm not saying that the other site did not do that well, but it did _so much more_ than I was ever willing to use it for. \n\nSo, I brought over my posts (that were already written in Markdown), the collection of my Projects (in a YAML file), and set off to see if I can actually do this in a timely manner.\n\nSince I already have professional experience writing production-level code in Vue, I was already aware of the concepts of a data-driven modern front end, and had a general idea on how I wanted things to work. The rest of my issues were mainly React Static related, since the _magic sauce_ is it's autocompilation of routes to something a webhost that is free and has no back end compilation (cough, GitHub Pages) can read without major headaches. Once I figured out how to read all files in a directory (thanks, FS!), the rest was just wrangling of it's contents (using gray-matter to read the file) to something that I can feed to Page Components and loop through accordingly.\n\nAnd that I did. All data is being handled and precompiled by React Static, and I access the data in a very familiar way (cough, state) and build out what I needed to.\n\nThis was a good exercise in what I can accomplish given enough brain power, and made me feel quite a lot better about my website, knowing that I built it from the ground up and if something breaks, I can (probably) fix it. \n\nI also find that data-driven front end development is a sweet middle ground between what I like doing - wrangling with data to make it usable, and making things look and feel good to users. And the rebuild was a great exercise in both - looking at the data and how it is structured, how I wanted it to be structured, and how it should look to the user once fed to components properly.\n","data":{"title":"Portfolio Rebuild in React","thumbnail_path":"/images/blog/react.png"},"isEmpty":false,"excerpt":"","path":"src/content/posts/2022-03-15-portfolio-rebuild-in-react.md"}},"path":"blog/post/2022-03-15-portfolio-rebuild-in-react"}
